namespace Задание4_8
{
    internal class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Введите число: ");
            int n = Convert.ToInt32(Console.ReadLine());
            int N = n;
            int result = 1;
            while (!(n / 10 == 0))
            {
                n = n / 10;
                result++;
            }
            Console.WriteLine($"Веденное число состоит из {result}");
            switch (result)
            {
                case 1:
                    {
                        Console.WriteLine("Ты серьезно хочешь отзеркалить цифру?");
                        break;
                    }
                case 2:
                    {
                        int del_1 = N / 10;
                        int ost_2 = N % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_2}{del_1} ");
                        break;
                    }
                case 3:
                    {
                        int del_1 = N / 100;
                        int ost_1 = (N % 100) / 10;
                        int ost_2 = ((N % 100) % 10);
                        Console.WriteLine($"Зеркальный результат {N} = {ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 4:
                    {
                        int del_1 = N / 1000;
                        int ost_1 = (N % 1000) / 100;
                        int ost_2 = ((N % 1000) % 100) / 10;
                        int ost_3 = ((N % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 5:
                    {
                        int del_1 = N / 10000;
                        int ost_1 = (N % 10000) / 1000;
                        int ost_2 = ((N % 10000) % 1000) / 100;
                        int ost_3 = (((N % 10000) % 1000) % 100) / 10;
                        int ost_4 = (((N % 10000) % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_4}{ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 6:
                    {
                        int del_1 = N / 100000;
                        int ost_1 = (N % 100000) / 10000;
                        int ost_2 = ((N % 100000) % 10000) / 1000;
                        int ost_3 = (((N % 100000) % 10000) % 1000) / 100;
                        int ost_4 = ((((N % 100000) % 10000) % 1000) % 100) / 10;
                        int ost_5 = ((((N % 100000) % 10000) % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_5}{ost_4}{ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 7:
                    {
                        int del_1 = N / 1000000;
                        int ost_1 = (N % 1000000) / 100000;
                        int ost_2 = ((N % 1000000) % 100000) / 10000;
                        int ost_3 = (((N % 1000000) % 100000) % 10000) / 1000;
                        int ost_4 = ((((N % 1000000) % 100000) % 10000) % 1000) / 100;
                        int ost_5 = (((((N % 1000000) % 100000) % 10000) % 1000) % 100) / 10;
                        int ost_6 = (((((N % 1000000) % 100000) % 10000) % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_6}{ost_5}{ost_4}{ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 8:
                    {
                        int del_1 = N / 10000000;
                        int ost_1 = (N % 10000000) / 1000000;
                        int ost_2 = ((N % 10000000) % 1000000) / 100000;
                        int ost_3 = (((N % 10000000) % 1000000) % 100000) / 10000;
                        int ost_4 = ((((N % 10000000) % 1000000) % 100000) % 10000) / 1000;
                        int ost_5 = (((((N % 10000000) % 1000000) % 100000) % 10000) % 1000) / 100;
                        int ost_6 = ((((((N % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) / 10;
                        int ost_7 = ((((((N % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_7}{ost_6}{ost_5}{ost_4}{ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                case 9:
                    {
                        int del_1 = N / 100000000;
                        int ost_1 = (N % 100000000) / 10000000;
                        int ost_2 = ((N % 100000000) % 10000000) / 1000000;
                        int ost_3 = (((N % 100000000) % 10000000) % 1000000) / 100000;
                        int ost_4 = ((((N % 100000000) % 10000000) % 1000000) % 100000) / 10000;
                        int ost_5 = (((((N % 100000000) % 10000000) % 1000000) % 100000) % 10000) / 1000;
                        int ost_6 = ((((((N % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) / 100;
                        int ost_7 = (((((((N % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) / 10;
                        int ost_8 = (((((((N % 100000000) % 10000000) % 1000000) % 100000) % 10000) % 1000) % 100) % 10;
                        Console.WriteLine($"Зеркальный результат {N} = {ost_8}{ost_7}{ost_6}{ost_5}{ost_4}{ost_3}{ost_2}{ost_1}{del_1}");
                        break;
                    }
                default:
                    {
                        break;
                    }
            }

            //Я так понимаю, есть куда легче вариант с применением while?
            Console.ReadKey();
        }
    }
}
